# Pivot Tables With Pandas

## Introduction

In this section, we'll learn about the various ways we can index and structure our data sets to make it easier to process or understand.  We start by learning about the difference between the **_Wide_** format and the **_Long_** format, compare basic flattened index structures with multi-hierarchical index structures, and then create them ourselves using aggregation functions and pivot tables!

## Objectives

You will be able to:

* Understand and explain what a multi-level hierarchical index is
* Understand, explain the difference and use df.pivot and pd.pivot_table
* Switch between “long” and “wide” in a DataFrame using stack() and unstack()
* Transform “wide” to “long” DataFrames using `melt`


## Long and Wide Formats


These two different formats refer to how we structure our data in a DataFrame.  We'll start by comparing the two, and discussing the salient points of each. 

### Wide Format

This is the common setup you're probably used to seeing. In the wide format, each column of data represents a variable, and each row represents 1 observation.  If this were a medical dataset, each row would be the data corresponding to a different patient. 

In wide format, the index usually an integer, with 0 being the topmost row.  


### Long Format

In Long format, each index is a point in time for each observation.  See the following diagram for comparison of the two:

<br>
<br>
<img src="images/Image_200_wide_v_long.png">

Note that in this format, a given observation has values across multiple rows.  This is an especially useful format when dealing with time series data, or aggregated data, because we can make use of **_Multi-Hierarchical Indexing_**,

## Multi-Hierarchical Indexing

A common task when working with data is to create pivot tables, or group the data using aggregation functions.  In this respect, the Long format provides a very neat, organized way of structuring our data with multiple levels of indexes, allowing us to cleanly and easily represent different combinations of data.  Consider the following pivot table below (which you'll create yourself in the next lab):
<br>
<br>

<img src="images/pt1.png">

We can see by looking at the left two columns that this DataFrame has a Multi-Hierarchical Index with 2 levels, consisting of the "State" and Gender.  In this way, we have an easy way to aggregate and organize information to allow us to quickly answer questions with our data like "What was the total number of deaths by gender in Alabama?".

Let's take a look at one more example:


<img src="images/pt2.png">

In this DataFrame, the index has three hierarchical levels, with the outermost being "State" and the innermost being "Race".



## Pivot Tables

Pivot tables are a common toolset that you might have used before in spreadsheet software such as Microsoft Excel or Google Sheets.  

<img src="./images/excel_pt.png">
<br>
<center>_An Example Pivot Table created in Microsoft Excel_</center>

Pivot tables allow us to quickly examine our data by "pivoting" on different variables of interest.  Pandas allows us to easily create pivot tables with a built-in `.pivot()` method.

In order to create a pivot table, we need to just call the `dataframe.pivot()` method and specify the `index` column, the `columns` to put in our pivot table, and the `value` to put in each cell.  

For example, let's look at a pivot table you'll create in the next lab:

```python
some_dataframe.pivot(index='State', columns='Gender', values='Deaths_mean')
```

would return this pivot table:

<img src="./images/pt3.png">

Don't worry about the data this actually contains, as you don't yet have the context because you haven't been introduced to the dataset. Instead, just pay attention to the structure of the indexes.

## Stacking and Unstacking Data

One of the quickest ways to manipulate the format of a dataset in python is to use the `.stack()` and `unstack()` methods built into pandas DataFrames.  

Take a look at the following diagram and see if you can figure out what the `unstack()` is doing.

<img src='./images/Image_201_unstack.png'>

By telling the `.unstack()` call which index we want to unstack, we can move it from the index section over to the right as a variable column--`.stack()` would do the exact opposite, moving data to the left and making it a level of the index.

In [ ]:
# Let's go back to our data we created in the previous chapter

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame([['Giulia', 19, "F", "Actress"],
                      ['Josh', 26, "M", "Data Scientist"]],                  
                       columns=columns)
user1

     name  age gender             job
0  Giulia   19      F         Actress
1    Josh   26      M  Data Scientist

In [4]:
user2 = pd.DataFrame([['Elisa', 22, "M", "student"],
                    ['Pablo', 58, "F", "Architect"]],
                     columns=columns)
user2

    name  age gender        job
0  Elisa   22      M    student
1  Pablo   58      F  Architect

In [5]:
user3 = pd.DataFrame(dict(name=['Pietro', 'Saltini'],
                  age=[33, 44], gender=['M', 'F'],
                  job=['Farmer', 'Scientist']))
user3

      name  age gender        job
0   Pietro   33      M     Farmer
1  Saltini   44      F  Scientist

In [6]:
user1.append(user2)
total_users = pd.concat([user1, user2 , user3])
total_users

      name  age gender             job
0   Giulia   19      F         Actress
1     Josh   26      M  Data Scientist
0    Elisa   22      M         student
1    Pablo   58      F       Architect
0   Pietro   33      M          Farmer
1  Saltini   44      F       Scientist

# Reshaping by pivoting
+ “Unpivots” a DataFrame from wide format to long (stacked) format,

In [7]:
staked_df = pd.melt(total_users, id_vars="name", var_name="variable", value_name="value")
print(staked_df)

       name variable           value
0    Giulia      age              19
1      Josh      age              26
2     Elisa      age              22
3     Pablo      age              58
4    Pietro      age              33
5   Saltini      age              44
6    Giulia   gender               F
7      Josh   gender               M
8     Elisa   gender               M
9     Pablo   gender               F
10   Pietro   gender               M
11  Saltini   gender               F
12   Giulia      job         Actress
13     Josh      job  Data Scientist
14    Elisa      job         student
15    Pablo      job       Architect
16   Pietro      job          Farmer
17  Saltini      job       Scientist

# Using the `Pivot()`

+ “pivots” a DataFrame from long (stacked) format to wide format,

In [8]:
print(staked_df.pivot(index='name', columns='variable', values='value'))

variable age gender             job
name
Elisa     22      M         student
Giulia    19      F         Actress
Josh      26      M  Data Scientist
Pablo     58      F       Architect
Pietro    33      M          Farmer
Saltini   44      F       Scientist

# Pivot Table Exercise

In [2]:
url = 'http://bit.ly/2cLzoxH'
data = pd.read_csv(url)
data.head(3)

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

# 1. Pandas pivot Simple Example
+ Let us see a simple example of Python Pivot using a dataframe with jus two columns. Let us subset our dataframe to contain just two columns, continent and lifeExp

In [5]:
# select two columns from the dataframe
df2 = data[['continent','lifeExp']]
df2.head()

  continent  lifeExp
0      Asia   28.801
1      Asia   30.332
2      Asia   31.997
3      Asia   34.020
4      Asia   36.088

In [8]:
print("Simple data has: ", df2.shape[0] , "rows and" , df2.shape[1] , "columns")

Simple data has:  1704 rows and 2 columns

+ We can see that df is a data frame in long format with two columns. As a simple example, we can use Pandas pivot_table to convert the tall table to a wide table, computing the mean lifeExp across continents. To do that, we will use pd.pivot_table with the data frame as one of the arguments and specify which variable we would like use for columns and which variable we would like to summarize. One of the arguments of pivot_table, agg_func has mean as default.

In [6]:
# simple example with pivot_table
pd.pivot_table(df2, values='lifeExp', columns='continent')

continent    Africa   Americas       Asia     Europe    Oceania
lifeExp    48.86533  64.658737  60.064903  71.903686  74.326208

In [13]:
# Let us see another simple example of pivot_table. In the above example we used pvot_table to compute mean lifeExp for each continent. We can compute mean lifeExp for each country, by simply specifying “country” for columns argument.

# simple example with pivot_table
df3 = data[['country','lifeExp']]
df3.head(3)

       country  lifeExp
0  Afghanistan   28.801
1  Afghanistan   30.332
2  Afghanistan   31.997

In [15]:
# pivot_table example
pd.pivot_table(df3, values='lifeExp',
                    columns='country')

country,Afghanistan,Albania,Algeria,Angola,Argentina,Australia,Austria,Bahrain,Bangladesh,Belgium,...,Uganda,United Kingdom,United States,Uruguay,Venezuela,Vietnam,West Bank and Gaza,Yemen Rep.,Zambia,Zimbabwe
lifeExp,37.478833,68.432917,59.030167,37.8835,69.060417,74.662917,73.10325,65.605667,49.834083,73.64175,...,47.618833,73.922583,73.4785,70.781583,66.580667,57.4795,60.328667,46.780417,45.996333,52.663167

+ We will get mean lifeExp for each country in wide format.

# 2. Pandas pivot_table on a data frame with three columns
Pandas pivot_table gets more useful when we try to summarize and convert a tall data frame with more than two variables into a wide data frame.

Let us say we have dataframe with three columns/variables and we want to convert this into a wide data frame have one of the variables summarized for each value of the other two variables.

Let us use three columns; continent, year, and lifeExp, from gapminder data and use pivot_table to compute mean lifeExp for each continent and year. Let us use ‘continent’ on columns and year as ‘index’

In [17]:
# select three columns from gapminder dataframe
df4 = data[['continent', 'year','lifeExp']]
df4.head()

  continent  year  lifeExp
0      Asia  1952   28.801
1      Asia  1957   30.332
2      Asia  1962   31.997
3      Asia  1967   34.020
4      Asia  1972   36.088

In [18]:
# pivot table example with three columns
pd.pivot_table(df4, values='lifeExp', 
                     index=['year'], 
                     columns='continent')

continent     Africa  Americas       Asia     Europe  Oceania
year
1952       39.135500  53.27984  46.314394  64.408500  69.2550
1957       41.266346  55.96028  49.318544  66.703067  70.2950
1962       43.319442  58.39876  51.563223  68.539233  71.0850
1967       45.334538  60.41092  54.663640  69.737600  71.3100
1972       47.450942  62.39492  57.319269  70.775033  71.9100
1977       49.580423  64.39156  59.610556  71.937767  72.8550
1982       51.592865  66.22884  62.617939  72.806400  74.2900
1987       53.344788  68.09072  64.851182  73.642167  75.3200
1992       53.629577  69.56836  66.537212  74.440100  76.9450
1997       53.598269  71.15048  68.020515  75.505167  78.1900
2002       53.325231  72.42204  69.233879  76.700600  79.7400
2007       54.806038  73.60812  70.728485  77.648600  80.7195

# 3. Pandas pivot_table with Different Aggregating Function
As mentioned before, pivot_table uses mean function for aggregating or summarizing data by default.  We can change the aggregating function,  if needed. For example, we can use aggfunc=’min’ to compute “minimum” lifeExp instead of “mean” lifeExp for each year and continent values.

In [19]:
# pivot table example with aggfunc='min'
pd.pivot_table(df4, values='lifeExp', 
                    index=['year'], 
                    columns='continent',
                    aggfunc='min')

continent  Africa  Americas    Asia  Europe  Oceania
year
1952       30.000    37.579  28.801  43.585   69.120
1957       31.570    40.696  30.332  48.079   70.260
1962       32.767    43.428  31.997  52.098   70.930
1967       34.113    45.032  34.020  54.336   71.100
1972       35.400    46.714  36.088  57.005   71.890
1977       36.788    49.923  31.220  59.507   72.220
1982       38.445    51.461  39.854  61.036   73.840
1987       39.906    53.636  40.822  63.108   74.320
1992       23.599    55.089  41.674  66.146   76.330
1997       36.087    56.671  41.763  68.835   77.550
2002       39.193    58.137  42.129  70.845   79.110
2007       39.613    60.916  43.828  71.777   80.204

+ Not only we can specify what aggregating function we want, we can also specify more than one aggregating functions. For example, if we are interested in bot minimum and maximum values of lifeExp for each year and continent, we can specify the functions as a list to the argument ‘aggfunc’

# Pivot table example with multiple aggregating functions

In [20]:
pd.pivot_table(df4, values='lifeExp',
                     index=['year'],
                     columns='continent',
                     aggfunc=[min,max])

              min                                      max                   \
continent  Africa Americas    Asia  Europe Oceania  Africa Americas    Asia
year
1952       30.000   37.579  28.801  43.585  69.120  52.724   68.750  65.390
1957       31.570   40.696  30.332  48.079  70.260  58.089   69.960  67.840
1962       32.767   43.428  31.997  52.098  70.930  60.246   71.300  69.390
1967       34.113   45.032  34.020  54.336  71.100  61.557   72.130  71.430
1972       35.400   46.714  36.088  57.005  71.890  64.274   72.880  73.420
1977       36.788   49.923  31.220  59.507  72.220  67.064   74.210  75.380
1982       38.445   51.461  39.854  61.036  73.840  69.885   75.760  77.110
1987       39.906   53.636  40.822  63.108  74.320  71.913   76.860  78.670
1992       23.599   55.089  41.674  66.146  76.330  73.615   77.950  79.360
1997       36.087   56.671  41.763  68.835  77.550  74.772   78.610  80.690
2002       39.193   58.137  42.129  70.845  79.110  75.744   79.770  82.000
2007       39.613   60.916  43.828  71.777  80.204  76.442   80.653  82.603


continent  Europe Oceania
year
1952       72.670  69.390
1957       73.470  70.330
1962       73.680  71.240
1967       74.160  71.520
1972       74.720  71.930
1977       76.110  73.490
1982       76.990  74.740
1987       77.410  76.320
1992       78.770  77.560
1997       79.390  78.830
2002       80.620  80.370
2007       81.757  81.235

+ When we give multiple aggregating functions, we would get a multi-indexed data frame as output.

## `.groupby()` and Aggregation Functions

Pandas DataFrames provide an easy way to group data using the `.groupby()` function.  To use this function, we just specify our indices in order (the columns we want to group the data by) and the function will return a new DataFrame containing the data grouped as we asked. 

For instance, if we wanted to group the Titanic Dataset by the port of embarkation, we would type:

```python
dataframe.groupby("Embarked")
```

This would give us a long format DataFrame with a flat index structure akin to the example in the top-most diagram.

Perhaps we want to group our data by both the port of embarkation and the ticket class (Labeled as _Pclass_ in the Titanic Dataset), we would type:

```python
dataframe.groupby(['Embarked', 'Pclass'])
```

This would return a DataFrame with a multi-hierarchical index, with `'Embarked'` being the outermost level.

Groupby statements are most commonly used with aggregation functions, which allow us to quickly calculate summary statistics such as the mean, median, min, max, mode, count, etc.  

Building on our last example, if we wanted to see the mean values for every grouping of `Embarked` and `Pclass` across different variables,  we would type:

```python
dataframe.groupby(['Embarked', 'Pclass']).mean()
```

Notice that we can make use of method chaining to quickly and concisely call the aggregation function at the same time as the groupby function.

In [11]:
names_dict ={
    'Name':['Ken','Jeff','John','Mike','Andrew','Ann','Sylvia','Dorothy','Emily','Loyford'],
    'Age':[31,52,56,12,45,np.nan,78,85,46,135],
    'Phone':[52,79,80,75,43,125,74,44,85,45],
    'Uni':['One','Two','Three','One','Two','Three','One','Two','Three','One']
}

In [13]:
data = pd.DataFrame(names_dict)
data.head()

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [14]:
# Check for missing data
data.isna().sum()

Name     0
Age      1
Phone    0
Uni      0
dtype: int64

In [15]:
# Age has missing datat so let's fill it up
data['Age'].mean()

60.0

In [16]:
data["Age"].fillna(60, inplace=True)

# Let's use the groupby aggregate

In [17]:
data.groupby("Uni")

In [18]:
data.groupby(["Uni"])["Age"].mean()

Uni
One      64.000000
Three    54.000000
Two      60.666667
Name: Age, dtype: float64

In [19]:
# Or
data.groupby('Uni')['Age'].mean()

Uni
One      64.000000
Three    54.000000
Two      60.666667
Name: Age, dtype: float64

In [20]:
data.groupby(['Uni'])['Age'].mean().sort_values(ascending=False)

Uni
One      64.000000
Two      60.666667
Three    54.000000
Name: Age, dtype: float64

In [21]:
data.groupby(['Uni'])['Age'].mean().sort_values(ascending=False).reset_index()

     Uni        Age
0    One  64.000000
1    Two  60.666667
2  Three  54.000000

## Load the Data
The data for this activity is stored in a file called `'causes_of_death.tsv'` which is a somewhat morbid dataset from the center for disease control. Note that the file extension .tsv indicates that this data is formatted slightly differently then the standard .csv, the difference being that it has 'tab separated values' instead of 'comma separated values'. As such, pass in the optional parameter `delimiter='\t'` into the `pd.read_csv()` method.

In [10]:
df = pd.read_csv('./data/causes_of_death.tsv', delimiter = '\t')
df.head()

,Notes,State,State Code,Ten-Year Age Groups,Ten-Year Age Groups Code,Gender,Gender Code,Race,Race Code,Deaths,Population,Crude Rate
0,NaN,Alabama,1,< 1 year,1,Female,F,American Indian or Alaska Native,1002-5,14,3579,Unreliable
1,NaN,Alabama,1,< 1 year,1,Female,F,Asian or Pacific Islander,A-PI,24,7443,322.5
2,NaN,Alabama,1,< 1 year,1,Female,F,Black or African American,2054-5,2093,169339,1236.0
3,NaN,Alabama,1,< 1 year,1,Female,F,White,2106-3,2144,347921,616.2
4,NaN,Alabama,1,< 1 year,1,Male,M,Asian or Pacific Islander,A-PI,33,7366,448.0

Our data is currently in **_Wide_** format.  We can tidy this up by converting it to **_Long_** format by using groupby statements to aggregate our data into a much neater, more readable format. 

## Groupby Aggregations

Complete the following groupby statements.

### 1) Groupby State and Gender. Sum the values.

In [22]:
# Your code here
df.groupby(['State','Gender']).sum().head()

                Notes  State Code  Deaths
State   Gender
Alabama Female    0.0          40  430133
        Male      0.0          41  430647
Alaska  Female    0.0          80   27199
        Male      0.0          84   36135
Arizona Female    0.0         180  396028

### 2) Groupby State and Gender and Race. Find the average values.

In [23]:
df.groupby(['State','Gender','Race']).mean().head()

                                                 Notes  State Code  \
State   Gender Race
Alabama Female American Indian or Alaska Native    NaN         1.0
               Asian or Pacific Islander           NaN         1.0
               Black or African American           NaN         1.0
               White                               NaN         1.0
        Male   American Indian or Alaska Native    NaN         1.0

                                                       Deaths
State   Gender Race
Alabama Female American Indian or Alaska Native     70.875000
               Asian or Pacific Islander            95.500000
               Black or African American          9074.000000
               White                             29890.636364
        Male   American Indian or Alaska Native     86.375000

### 3) Groupby Gender and Race. Find the minimum values.

In [24]:
df.groupby(['Gender','Race']).min().head()

                                         Notes    State  State Code  \
Gender Race
Female American Indian or Alaska Native    NaN  Alabama           1
       Asian or Pacific Islander           NaN  Alabama           1
       Black or African American           NaN  Alabama           1
       White                               NaN  Alabama           1
Male   American Indian or Alaska Native    NaN  Alabama           1

                                        Ten-Year Age Groups  \
Gender Race
Female American Indian or Alaska Native           1-4 years
       Asian or Pacific Islander                  1-4 years
       Black or African American                  1-4 years
       White                                      1-4 years
Male   American Indian or Alaska Native           1-4 years

                                        Ten-Year Age Groups Code Gender Code  \
Gender Race
Female American Indian or Alaska Native                        1           F
       Asian or Pacific Islander                               1           F
       Black or African American                               1           F
       White                                                   1           F
Male   American Indian or Alaska Native                        1           M

                                        Race Code  Deaths Population  \
Gender Race
Female American Indian or Alaska Native    1002-5      10     100285
       Asian or Pacific Islander             A-PI      10     100371
       Black or African American           2054-5      10     100170
       White                               2106-3      12    1000704
Male   American Indian or Alaska Native    1002-5      10       1001

                                        Crude Rate
Gender Race
Female American Indian or Alaska Native       10.4
       Asian or Pacific Islander              10.1
       Black or African American             100.3
       White                                  10.1
Male   American Indian or Alaska Native    10000.0

# To be completed as separated exercise as I am tired.

In [ ]:

## Summary

We spent some time in this lesson learning about approaches to indexing and structuring our data sets. In the next lesson, we'll get some hands-on practice!